FelixLyfe/esp8266-ai/firmware/src/main.cpp
// Paints the full square border in one color (all four sides), used for the
// attention flash so the whole edge blinks, not just the filled quota arc.
void drawFullBorder(uint16_t color) {
  ringLastPct = -1000; // ring got painted over; next ring draw must repaint
  int x0 = RING_MARGIN, y0 = RING_MARGIN;
  int side = SCREEN_W - 2 * RING_MARGIN;
  tft.fillRect(x0, y0, side, RING_THICKNESS, color);                              // top
  tft.fillRect(x0, SCREEN_H - RING_MARGIN - RING_THICKNESS, side, RING_THICKNESS, color); // bottom
  tft.fillRect(x0, y0, RING_THICKNESS, side, color);                              // left
  tft.fillRect(SCREEN_W - RING_MARGIN - RING_THICKNESS, y0, RING_THICKNESS, side, color); // right
}

// Square progress ring hugging the screen edge. `pct` of the perimeter
// (clockwise from top-left) is drawn in `color`, the rest in dark grey.
void drawSquareRing(float pct, uint16_t color) {
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  if (pct == ringLastPct && color == ringLastColor) return; // nothing changed
  ringLastPct = pct;
  ringLastColor = color;

  int x0 = RING_MARGIN, y0 = RING_MARGIN;
  int x1 = SCREEN_W - RING_MARGIN, y1 = SCREEN_H - RING_MARGIN;
  int side = x1 - x0;
  float perimeter = side * 4.0;

  // Unfilled track is drawn black (not grey) so it blends into the background
  // and only the active quota portion is visible - still needs to be actively
  // repainted each time though, to erase a previously longer fill if the
  // percentage drops (e.g. a quota window reset).
  tft.fillRect(x0, y0, side, RING_THICKNESS, TFT_BLACK);                  // top
  tft.fillRect(x1 - RING_THICKNESS, y0, RING_THICKNESS, side, TFT_BLACK); // right
  tft.fillRect(x0, y1 - RING_THICKNESS, side, RING_THICKNESS, TFT_BLACK); // bottom
  tft.fillRect(x0, y0, RING_THICKNESS, side, TFT_BLACK);                  // left

  // filled portion, clockwise: top -> right -> bottom -> left
  float remaining = perimeter * (pct / 100.0);
  if (remaining <= 0) return;

  float seg = min(remaining, (float)side);
  tft.fillRect(x0, y0, (int)seg, RING_THICKNESS, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x1 - RING_THICKNESS, y0, RING_THICKNESS, (int)seg, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x1 - (int)seg, y1 - RING_THICKNESS, (int)seg, RING_THICKNESS, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x0, y1 - (int)seg, RING_THICKNESS, (int)seg, color);
}

void drawClaudeSprite(int frameIdx) {
  drawSpriteFrame(claudeCustom, CLAUDE_SPRITE_FILE, claude_sprite_frames, frameIdx, CLAUDE_SPRITE_W,
                  CLAUDE_SPRITE_H, CLAUDE_FRAME_BYTES);
}

void drawCodexSprite(int frameIdx) {
  drawSpriteFrame(codexCustom, CODEX_SPRITE_FILE, codex_sprite_frames, frameIdx, CODEX_SPRITE_W, CODEX_SPRITE_H,
                  CODEX_FRAME_BYTES);
}

String pctText(float pct) {
  return pct >= 0 ? String((int)lroundf(constrain(pct, 0.0f, 100.0f))) + "%" : "-";
}

float remainingPct(float usedPct) {
  return usedPct >= 0 ? constrain(100.0f - usedPct, 0.0f, 100.0f) : -1.0f;
}

// Quota readout below the sprite: two remaining-quota columns, small grey label
// over a big font-4 percentage. Values repaint only when their text changes
// (force = after a full-screen clear), so the 5s poll never flashes them.
const int QUOTA_LABEL_Y = 183, QUOTA_VALUE_Y = 199;
const int QUOTA_COL1_X = 70, QUOTA_COL2_X = 170;
String lastQuota5h, lastQuotaWk, lastQuotaLabel1, lastQuotaLabel2;

// Faux-bold: the packed TFT_eSPI fonts have no bold face, so draw twice with
// a 1px x offset. Transparent draws - the caller must have cleared the region.
void drawBoldString(const String &s, int x, int y, int font, uint16_t color) {
  tft.setTextColor(color);
  tft.drawString(s, x, y, font);
  tft.drawString(s, x + 1, y, font);
}

void drawQuotaTextWithLabels(const String &label1, float pct1, const String &label2, float pct2, bool force) {
  tft.setTextDatum(TC_DATUM);
  String v1 = pctText(pct1), v2 = pctText(pct2);
  bool has1 = pct1 >= 0, has2 = pct2 >= 0;
  bool changed = force || v1 != lastQuota5h || v2 != lastQuotaWk
      || label1 != lastQuotaLabel1 || label2 != lastQuotaLabel2;
  if (!changed) return;
  lastQuota5h = v1; lastQuotaWk = v2;
  lastQuotaLabel1 = label1; lastQuotaLabel2 = label2;
  tft.fillRect(12, QUOTA_LABEL_Y, 216, 44, TFT_BLACK);
  if (has1 && has2) {
    drawBoldString(label1, QUOTA_COL1_X, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
    drawBoldString(label2, QUOTA_COL2_X, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
    drawBoldString(v1, QUOTA_COL1_X, QUOTA_VALUE_Y, 4, TFT_WHITE);
    drawBoldString(v2, QUOTA_COL2_X, QUOTA_VALUE_Y, 4, TFT_WHITE);
  } else if (has1 || has2) {
    drawBoldString(has1 ? label1 : label2, SCREEN_CX, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
    drawBoldString(has1 ? v1 : v2, SCREEN_CX, QUOTA_VALUE_Y, 4, TFT_WHITE);
  }
}

void drawQuotaText(float hourPct, float weekPct, bool force) {
  drawQuotaTextWithLabels("5h LEFT", hourPct, "Wk LEFT", weekPct, force);
}

// ---------- quota-exhausted countdown ----------
// When the current app's 5h or weekly window is used up, the pet is replaced
// by a countdown to that window's reset (bridge sends minutes-until-reset).
// A spent weekly window blocks usage even after the 5h one resets, so the
// weekly countdown takes priority when both are exhausted.

enum CdType { CD_NONE, CD_5H, CD_WEEK };

float currentHourPct() {
  if (currentApp == APP_CLAUDE) return claudeStatus.fiveHourPct;
  if (currentApp == APP_CODEX) return codexStatus.primaryPct;
  return -1;
}

int currentHourResetMin() {
  if (currentApp == APP_CLAUDE) return claudeStatus.fiveHourResetMin;
  if (currentApp == APP_CODEX) return codexStatus.primaryResetMin;
  return -1;
}

float currentWeekPct() {
  if (currentApp == APP_CLAUDE) return claudeStatus.sevenDayPct;
  if (currentApp == APP_CODEX) return codexStatus.weeklyPct;
  return -1;
}

int currentWeekResetMin() {
  if (currentApp == APP_CLAUDE) return claudeStatus.sevenDayResetMin;
  if (currentApp == APP_CODEX) return codexStatus.weeklyResetMin;
  return -1;
}

CdType desiredCountdown() {
  if (currentApp == APP_CURSOR || currentApp == APP_NONE) return CD_NONE;
  if (currentWeekPct() >= 99.9f && currentWeekResetMin() >= 0) return CD_WEEK;
  if (currentHourPct() >= 99.9f && currentHourResetMin() >= 0) return CD_5H;
  return CD_NONE;
}

CdType showingCd = CD_NONE; // what's on screen now (vs desiredCountdown())
String lastCountdown;

