FelixLyfe/esp8266-ai/firmware/src/main.cpp
// The bridge only reports whole minutes, so the seconds tick locally against
// a deadline anchored at millis(). Re-anchor only when the bridge disagrees
// by more than ~a minute (new window, big clock drift), otherwise a poll
// landing mid-minute would make the seconds jump around.
unsigned long cdDeadlineMs = 0; // 0 = not anchored
ActiveApp cdApp = APP_CLAUDE;   // which app/window the anchor belongs to
CdType cdAnchorType = CD_NONE;

void syncCountdownDeadline() {
  int m = showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin();
  if (m < 0) {
    cdDeadlineMs = 0;
    return;
  }
  long bridgeSec = (long)m * 60 + 30; // bridge floors to minutes: assume mid-minute
  long ourSec = (long)(cdDeadlineMs - millis()) / 1000;
  if (cdDeadlineMs == 0 || cdApp != currentApp || cdAnchorType != showingCd || ourSec < 0 ||
      labs(ourSec - bridgeSec) > 90) {
    cdDeadlineMs = millis() + (unsigned long)bridgeSec * 1000UL;
    cdApp = currentApp;
    cdAnchorType = showingCd;
  }
}

void drawCountdown(bool force) {
  long remain = cdDeadlineMs ? (long)(cdDeadlineMs - millis()) / 1000
                             : (long)(showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin()) * 60;
  if (remain < 0) remain = 0;
  char buf[16];
  long hours = remain / 3600;
  if (hours >= 100) // weekly can be up to 168h: h:mm:ss wouldn't fit the ring
    snprintf(buf, sizeof(buf), "%ld:%02ld", hours, (remain % 3600) / 60);
  else
    snprintf(buf, sizeof(buf), "%ld:%02ld:%02ld", hours, (remain % 3600) / 60, remain % 60);
  String t(buf);
  if (!force && t == lastCountdown) return;
  // in-place glyph overwrite can't erase a shrinking string (h:mm:ss width is
  // constant, but 100:00 -> 99:59:59 changes layout once) - clear on any
  // length change
  if (t.length() != lastCountdown.length()) force = true;
  lastCountdown = t;
  tft.setTextDatum(TC_DATUM);
  if (force) {
    tft.fillRect(SCREEN_CX - 99, 66, 198, 84, TFT_BLACK);
    drawBoldString(showingCd == CD_WEEK ? "Wk RESET IN" : "5h RESET IN", SCREEN_CX, 72, 2, TFT_LIGHTGREY);
  }
  // Background-color draw overwrites glyphs in place (no clear-then-draw
  // flash between seconds).
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.drawString(t, SCREEN_CX, 102, 6);
}

// App logo in the top-left corner (inside the quota ring) so a glance tells
// which app the screen is currently showing. Drawn row-by-row from PROGMEM
// through rowBuf, same as the sprite path.
const int LOGO_X = 14, LOGO_Y = 18;

// 49x56 one-bit mask rasterized from Cursor's SVG path. Keeping the source
// aspect ratio makes the 40x40 top-left slot match Claude/Codex without
// pulling a floating-point polygon rasterizer into the ESP8266 firmware.
static const uint8_t cursorLogoBits[] = {
  0x00,0x00,0x01,0xC0,0x00,0x00,0x00,0x00,0x03,0xF8,0x00,0x00,0x00,0x00,0x03,0xFE,
  0x00,0x00,0x00,0x00,0x07,0xFF,0xC0,0x00,0x00,0x00,0x0F,0xFF,0xF8,0x00,0x00,0x00,
  0x1F,0xFF,0xFF,0x00,0x00,0x00,0x1F,0xFF,0xFF,0xC0,0x00,0x00,0x3F,0xFF,0xFF,0xF8,
  0x00,0x00,0x7F,0xFF,0xFF,0xFF,0x00,0x00,0xFF,0xFF,0xFF,0xFF,0xE0,0x00,0xFF,0xFF,
  0xFF,0xFF,0xF8,0x01,0xFF,0xFF,0xFF,0xFF,0xFF,0x03,0xFF,0xFF,0xFF,0xFF,0xFF,0xE3,
  0xFF,0xFF,0xFF,0xFF,0xFF,0xFB,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xC0,0x00,0x00,0x00,
  0x00,0x07,0xF8,0x00,0x00,0x00,0x00,0x03,0xFE,0x00,0x00,0x00,0x00,0x01,0xFF,0xC0,
  0x00,0x00,0x00,0x01,0xFF,0xF8,0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0x00,0x00,
  0xFF,0xFF,0xC0,0x00,0x00,0x00,0xFF,0xFF,0xF8,0x00,0x00,0x00,0x7F,0xFF,0xFF,0x00,
  0x00,0x00,0x7F,0xFF,0xFF,0xC0,0x00,0x00,0x3F,0xFF,0xFF,0xF8,0x00,0x00,0x3F,0xFF,
  0xFF,0xFF,0x00,0x00,0x1F,0xFF,0xFF,0xFF,0xE0,0x00,0x1F,0xFF,0xFF,0xFF,0xF0,0x00,
  0x1F,0xFF,0xFF,0xFF,0xF8,0x00,0x0F,0xFF,0xFF,0xFF,0xFC,0x00,0x0F,0xFF,0xFF,0xFF,
  0xFE,0x00,0x07,0xFF,0xFF,0xFF,0xFF,0x00,0x07,0xFF,0xFF,0xFF,0xFF,0x80,0x03,0xFF,
  0xFF,0xFF,0xFF,0xC0,0x03,0xFF,0xFF,0xFF,0xFF,0xE0,0x03,0xFF,0xFF,0xFF,0xFF,0xF0,
  0x01,0xFF,0xFF,0xFF,0xFF,0xF8,0x01,0xFF,0xFF,0xFF,0xFF,0xFC,0x00,0xFF,0xFF,0xFF,
  0xFF,0xFE,0x00,0xFF,0xFF,0xFF,0xFF,0xFF,0x00,0x7F,0xFF,0xFF,0xFF,0xFF,0x80,0x7F,
  0xFF,0xDF,0xFF,0xFF,0xC0,0x7F,0xFF,0xC7,0xFF,0xFF,0xE0,0x3F,0xFF,0xC0,0xFF,0xFF,
  0xF0,0x3F,0xFF,0x80,0x1F,0xFF,0xF8,0x1F,0xFF,0x00,0x07,0xFF,0xFC,0x1F,0xFF,0x00,
  0x00,0xFF,0xFE,0x1F,0xFE,0x00,0x00,0x1F,0xFF,0x0F,0xFC,0x00,0x00,0x03,0xFF,0x8F,
  0xF8,0x00,0x00,0x00,0xFF,0xC7,0xF8,0x00,0x00,0x00,0x1F,0xE7,0xF0,0x00,0x00,0x00,
  0x03,0xF3,0xE0,0x00,0x00,0x00,0x00,0x7F,0xC0,0x00,0x00,0x00,0x00,0x1F,0xC0,0x00,
  0x00,0x00,0x00,0x03,0x80,0x00,0x00
};
static_assert(sizeof(cursorLogoBits) == 343, "Cursor logo mask must be 49x56 bits");

void drawCursorMark(int cx, int cy, int size) {
  const int width = (size * 49 + 28) / 56;
  const int left = cx - width / 2;
  const int top = cy - size / 2;
  for (int y = 0; y < size; y++) {
    int sourceY = y * 56 / size;
    int runStart = -1;
    for (int x = 0; x <= width; x++) {
      bool on = false;
      if (x < width) {
        int sourceX = x * 49 / width;
        int bit = sourceY * 49 + sourceX;
        on = (cursorLogoBits[bit / 8] & (0x80 >> (bit & 7))) != 0;
      }
      if (on && runStart < 0) runStart = x;
      if (!on && runStart >= 0) {
        tft.fillRect(left + runStart, top + y, x - runStart, 1, TFT_WHITE);
        runStart = -1;
      }
    }
  }
}

void drawStaleTag() {
  tft.fillRect(174, 16, 52, 16, TFT_BLACK);
  if (!appStale(currentApp)) return;
  tft.setTextDatum(TR_DATUM);
  drawBoldString("STALE", 224, 17, 1, TFT_ORANGE);
}

void drawNoAIState(bool force = false) {
  int state = accountsChecked ? 1 : 0;
  if (!force && state == lastNoAIState) return;
  lastNoAIState = state;
  tft.fillScreen(TFT_BLACK);
  ringLastPct = -1000;
  tft.setTextDatum(MC_DATUM);
  tft.setTextColor(accountsChecked ? TFT_ORANGE : TFT_CYAN, TFT_BLACK);
  tft.drawString(accountsChecked ? "NO AI LOGIN" : "CHECKING ACCOUNTS...", SCREEN_CX, 112, 2);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("USB CONNECTED", SCREEN_CX, 139, 1);
}

void drawAppLogo() {
  if (currentApp == APP_CURSOR || currentApp == APP_NONE) return;
  const uint16_t *logo = (currentApp == APP_CLAUDE) ? claude_logo_0 : codex_logo_0;
  int w = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_W : CODEX_LOGO_W;
  int h = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_H : CODEX_LOGO_H;
  for (int r = 0; r < h; r++) {
    memcpy_P(rowBuf, logo + (size_t)r * w, (size_t)w * 2);
    tft.pushImage(LOGO_X, LOGO_Y + r, w, 1, rowBuf);
  }
}

// Claude's ring percentage: real 5h OAuth quota from the bridge when known,
// otherwise fall back to elapsed session time as a rough stand-in.
float claudeRingPct() {
  if (claudeStatus.fiveHourPct >= 0) return claudeStatus.fiveHourPct;
  return claudeStatus.sessionWindowMin > 0
             ? (100.0 * claudeStatus.sessionMin / claudeStatus.sessionWindowMin)
             : 0;
}

// Redraws whichever app is currently active, full screen: quota ring +
// sprite (or the reset countdown while the 5h window is exhausted).
// Full clear + repaint - only for real transitions (app switch, mode return,
// sprite change); steady-state data updates go through refreshActiveApp().
void drawActiveApp() {
  if (currentApp == APP_NONE) { drawNoAIState(true); return; }
  lastNoAIState = -1;
  tft.fillScreen(TFT_BLACK);
  ringLastPct = -1000; // screen was cleared: force the ring repaint
  showingCd = desiredCountdown();
  if (showingCd != CD_NONE) syncCountdownDeadline();
  else cdDeadlineMs = 0;
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(remainingPct(claudeRingPct()), currentStatusColor());
    if (showingCd == CD_NONE) drawClaudeSprite(claudeFrame);
    drawQuotaText(remainingPct(claudeRingPct()), remainingPct(claudeStatus.sevenDayPct), true);
  } else if (currentApp == APP_CODEX) {
    float ringUsedPct = codexStatus.primaryPct >= 0 ? codexStatus.primaryPct : codexStatus.weeklyPct;
    drawSquareRing(max(remainingPct(ringUsedPct), 0.0f), currentStatusColor());
    if (showingCd == CD_NONE) drawCodexSprite(codexFrame);
    drawQuotaText(remainingPct(codexStatus.primaryPct), remainingPct(codexStatus.weeklyPct), true);
  } else {
    drawSquareRing(remainingPct(cursorStatus.totalPct), currentStatusColor());
    drawCursorMark(SCREEN_CX, 105, 92);
    drawQuotaTextWithLabels("AUTO LEFT", remainingPct(cursorStatus.autoPct),
                            "API LEFT", remainingPct(cursorStatus.apiPct), true);
  }
  if (showingCd != CD_NONE) drawCountdown(true);
  drawAppLogo();
  drawStaleTag();
}

// In-place refresh after a bridge poll: ring repaint + only the text that
// actually changed. No fillScreen, so the 5s poll doesn't blank the screen.
void refreshActiveApp() {
  if (currentApp == APP_NONE) { drawNoAIState(); return; }
  if (desiredCountdown() != showingCd) { // pet <-> countdown (or 5h <-> weekly) swap
    drawActiveApp();
    return;
  }
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(remainingPct(claudeRingPct()), currentStatusColor());
    drawQuotaText(remainingPct(claudeRingPct()), remainingPct(claudeStatus.sevenDayPct), false);
  } else if (currentApp == APP_CODEX) {
    float ringUsedPct = codexStatus.primaryPct >= 0 ? codexStatus.primaryPct : codexStatus.weeklyPct;
    drawSquareRing(max(remainingPct(ringUsedPct), 0.0f), currentStatusColor());
    drawQuotaText(remainingPct(codexStatus.primaryPct), remainingPct(codexStatus.weeklyPct), false);
  } else {
    drawSquareRing(remainingPct(cursorStatus.totalPct), currentStatusColor());
    drawQuotaTextWithLabels("AUTO LEFT", remainingPct(cursorStatus.autoPct),
                            "API LEFT", remainingPct(cursorStatus.apiPct), false);
  }
  if (showingCd != CD_NONE) {
    syncCountdownDeadline();
    drawCountdown(false);
  }
  drawStaleTag();
}

// Redraws just the ring (cheap) - used for status color animation ticks
// between full redraws.
void redrawRingOnly() {
  if (currentApp == APP_NONE) return;
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(remainingPct(claudeRingPct()), currentStatusColor());
  } else if (currentApp == APP_CODEX) {
    float ringUsedPct = codexStatus.primaryPct >= 0 ? codexStatus.primaryPct : codexStatus.weeklyPct;
    drawSquareRing(max(remainingPct(ringUsedPct), 0.0f), currentStatusColor());
  } else {
    drawSquareRing(remainingPct(cursorStatus.totalPct), currentStatusColor());
  }
}

// Who gets the screen:
//   - display mode pinned (Mac app) -> that app, always
//   - exactly one app working       -> that app, immediately
//   - both working                  -> alternate every SWITCH_BOTH_MS (2s)
//   - neither working               -> alternate slowly (SWITCH_IDLE_MS)
bool updateActiveApp() {
  ActiveApp order[3] = {APP_CLAUDE, APP_CODEX, APP_CURSOR};
  if ((displayMode == MODE_CLAUDE && !appEligible(APP_CLAUDE))
      || (displayMode == MODE_CODEX && !appEligible(APP_CODEX))
      || (displayMode == MODE_CURSOR && !appEligible(APP_CURSOR))) displayMode = MODE_AUTO;
  bool eligible[3], working[3], needsInput[3] = {
      claudeStatus.needsInput, codexStatus.needsInput, false};
  int workingCount = 0;
  for (int i = 0; i < 3; i++) {
    eligible[i] = appEligible(order[i]);
    working[i] = appWorking(order[i]);
    if (eligible[i] && working[i]) workingCount++;
  }
  int pinned = displayMode == MODE_CLAUDE ? APP_CLAUDE
      : displayMode == MODE_CODEX ? APP_CODEX : displayMode == MODE_CURSOR ? APP_CURSOR : -1;
  unsigned long interval = workingCount > 1 ? SWITCH_BOTH_MS : SWITCH_IDLE_MS;
  bool rotateNow = millis() - lastSwitchMs >= interval;
  ActiveApp desired = (ActiveApp)RotationPolicy::choose(eligible, working, needsInput,
      pinned, (int)currentApp, rotateNow);

