FelixLyfe/esp8266-ai/firmware/src/main.cpp
// Chart tick, every NET_DRAW_INTERVAL_MS: shift in queued sample(s), then
// one atomic repaint. If the queue backs up after a slow poll, it works off
// up to three samples per tick until it's back in step.
void netDrawTick() {
  if (!netChromeDrawn) {
    resetNetChart();
    drawNetChrome();
    netChromeDrawn = true;
    netHeaderDirty = true;
  }
  if (netHeaderDirty) {
    drawNetHeaderIfChanged();
    drawNetNetworkIfChanged();
    netHeaderDirty = false;
  }
  if (netQCount == 0) return;
  int steps = min(netQCount, netQCount > 16 ? 3 : 1);
  while (steps-- > 0 && netQCount > 0) {
    memmove(netHistRx, netHistRx + 1, sizeof(long) * (NET_CHART_W - 1));
    memmove(netHistTx, netHistTx + 1, sizeof(long) * (NET_CHART_W - 1));
    netHistRx[NET_CHART_W - 1] = netQRx[netQHead];
    netHistTx[NET_CHART_W - 1] = netQTx[netQHead];
    netQHead = (netQHead + 1) % NET_QUEUE;
    netQCount--;
  }
  drawNetChart();
}

// Ingests one /net payload (from HTTP polling or a serial #NET frame) into
// the sample queue. The seq field tells us which samples we've already
// queued, so overlapping tails are fine.
bool handleNetPayload(const String &payload) {
  JsonDocument doc;
  if (deserializeJson(doc, payload)) return false;
  netCurRx = doc["rx_bps"] | 0L;
  netCurTx = doc["tx_bps"] | 0L;
  netNetworkName = doc["network_name"] | "Not connected";
  netHeaderDirty = true;
  long seq = doc["seq"] | -1L;
  JsonArray rx = doc["rx"], tx = doc["tx"];
  int n = min(rx.size(), tx.size());
  // how many of the tail samples are new to us
  int fresh = (netSeq < 0) ? min(n, 8) : (int)min((long)n, seq - netSeq);
  if (fresh < 0) fresh = 0;
  for (int i = n - fresh; i < n; i++) {
    if (netQCount >= NET_QUEUE) break; // queue full: drop the excess
    int tail = (netQHead + netQCount) % NET_QUEUE;
    netQRx[tail] = rx[i].as<long>();
    netQTx[tail] = tx[i].as<long>();
    netQCount++;
  }
  if (seq >= 0) netSeq = seq;
  return true;
}

// Refills the sample queue from the bridge's /net endpoint.
void pollNet() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/net";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) handleNetPayload(http.getString());
  http.end();
}

String fitText(String s, int maxPx, int font) {
  if (tft.textWidth(s, font) <= maxPx) return s;
  while (s.length() > 0 && tft.textWidth(s + "...", font) > maxPx) {
    s.remove(s.length() - 1);
  }
  return s + "...";
}

void drawCPUScreen() {
  if (!cpuChromeDrawn) {
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    tft.drawString("MAC CPU", SCREEN_CX, 22, 4);
    tft.drawString("SYSTEM LOAD", SCREEN_CX, 202, 2);
    cpuChromeDrawn = true;
    cpuLastPct = -1;
  }
  if (cpuPct == cpuLastPct) return;
  cpuLastPct = cpuPct;
  uint16_t color = cpuPct >= 85 ? TFT_RED : cpuPct >= 60 ? TFT_YELLOW : TFT_GREEN;
  tft.fillRect(0, 58, SCREEN_W, 86, TFT_BLACK);
  tft.setTextDatum(MC_DATUM);
  tft.setTextColor(color, TFT_BLACK);
  tft.setTextSize(2);
  tft.drawString(String(cpuPct) + "%", SCREEN_CX, 100, 4);
  tft.setTextSize(1);
  const int bx = 20, by = 160, bw = 200, bh = 18;
  tft.fillRect(bx, by, bw, bh, 0x3186);
  tft.fillRect(bx, by, bw * cpuPct / 100, bh, color);
}

bool handleCPUPayload(const String &payload) {
  JsonDocument doc;
  if (deserializeJson(doc, payload)) return false;
  cpuPct = constrain(doc["cpu_pct"] | 0, 0, 100);
  if (displayMode == MODE_CPU) drawCPUScreen();
  return true;
}

void pollCPU() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/cpu";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) handleCPUPayload(http.getString());
  http.end();
}

// ---------- WiFi / bridge polling ----------

WiFiManager wifiManager;
enum WiFiFallbackState { WIFI_FALLBACK_OFF, WIFI_FALLBACK_CONNECTING, WIFI_FALLBACK_PORTAL, WIFI_FALLBACK_CONNECTED };
WiFiFallbackState wifiFallbackState = WIFI_FALLBACK_OFF;
unsigned long wifiFallbackStartedMs = 0;
unsigned long bootMs = 0;

void configModeCallback(WiFiManager *wm) {
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("WiFi setup needed", 8, 32, 2);
  tft.drawString("Connect phone to AP:", 8, 62, 2);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString(WIFI_PORTAL_AP_NAME, 8, 87, 2);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("then open 192.168.4.1", 8, 117, 2);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawString("Or: plug into the computer", 8, 155, 2);
  tft.drawString("via USB - no WiFi needed", 8, 178, 2);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("Firmware v" FW_VERSION, 8, 215, 2);
}

void beginWiFiFallback() {
  if (wifiFallbackState != WIFI_FALLBACK_OFF) return;
  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setConfigPortalBlocking(false);
  WiFi.mode(WIFI_STA);
  WiFi.begin(); // reconnect the credentials already stored by WiFiManager
  wifiFallbackState = WIFI_FALLBACK_CONNECTING;
  wifiFallbackStartedMs = millis();
  mainUiShown = false;
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("USB disconnected", 8, 75, 2);
  tft.drawString("Connecting WiFi fallback...", 8, 105, 2);
}

void stopWiFiFallbackForUSB() {
  if (wifiFallbackState == WIFI_FALLBACK_OFF) return;
  if (wifiFallbackState == WIFI_FALLBACK_PORTAL) wifiManager.stopConfigPortal();
  if (webServerStarted) {
    webServer.stop();
    webServerStarted = false;
  }
  WiFi.disconnect(false);
  WiFi.mode(WIFI_OFF);
  wifiFallbackState = WIFI_FALLBACK_OFF;
}

void serviceWiFiFallback() {
  if (wiredActive()) {
    stopWiFiFallbackForUSB();
    return;
  }
  if (wifiFallbackState == WIFI_FALLBACK_OFF) {
    if (millis() - bootMs >= 5000UL) beginWiFiFallback();
    return;
  }
  if (wifiFallbackState == WIFI_FALLBACK_PORTAL) wifiManager.process();
  if (WiFi.status() == WL_CONNECTED) {
    if (wifiFallbackState == WIFI_FALLBACK_PORTAL) wifiManager.stopConfigPortal();
    wifiFallbackState = WIFI_FALLBACK_CONNECTED;
    if (!webServerStarted) {
      setupWebServer();
      webServerStarted = true;
      showMainUiIfNeeded();
      lastPollMs = 0;
    }
    return;
  }
  if (wifiFallbackState == WIFI_FALLBACK_CONNECTING && millis() - wifiFallbackStartedMs >= 10000UL) {
    WiFi.disconnect(false);
    wifiManager.startConfigPortal(WIFI_PORTAL_AP_NAME);
    wifiFallbackState = WIFI_FALLBACK_PORTAL;
  }
}

bool parseStatusJson(const String &payload) {
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload);
  if (err) return false;

  JsonObject c = doc["claude"];
  if (!c.isNull()) {
    claudeStatus.status = c["status"] | "unknown";
    claudeStatus.tokensToday = c["tokens_today"] | 0;
    claudeStatus.sessionMin = c["session_min"] | 0;
    claudeStatus.sessionWindowMin = c["session_window_min"] | 300;
    claudeStatus.fiveHourPct = c["five_hour_pct"] | -1.0;
    claudeStatus.fiveHourResetMin = c["five_hour_reset_min"] | -1;
    claudeStatus.sevenDayPct = c["seven_day_pct"] | -1.0;
    claudeStatus.sevenDayResetMin = c["seven_day_reset_min"] | -1;
    claudeStatus.needsInput = c["needs_input"] | false;
    claudeStatus.eligible = c["eligible"] | false;
    claudeStatus.stale = c["stale"] | false;
  }

  JsonObject x = doc["codex"];
  if (!x.isNull()) {
    codexStatus.status = x["status"] | "unknown";
    codexStatus.tokensToday = x["tokens_today"] | 0;
    codexStatus.primaryPct = x["primary_pct"] | -1.0;
    codexStatus.primaryResetMin = x["primary_reset_min"] | -1;
    codexStatus.weeklyPct = x["weekly_pct"] | -1.0;
    codexStatus.weeklyResetMin = x["weekly_reset_min"] | -1;
    codexStatus.needsInput = x["needs_input"] | false;
    codexStatus.eligible = x["eligible"] | false;
    codexStatus.stale = x["stale"] | false;
  }
  JsonObject r = doc["cursor"];
  if (!r.isNull()) {
    cursorStatus.totalPct = r["total_pct"] | -1.0;
    cursorStatus.autoPct = r["auto_pct"] | -1.0;
    cursorStatus.apiPct = r["api_pct"] | -1.0;
    cursorStatus.billingResetMin = r["billing_reset_min"] | -1;
    cursorStatus.eligible = r["eligible"] | false;
    cursorStatus.stale = r["stale"] | false;
  }
  accountsChecked = doc["accounts_checked"] | false;
  if ((displayMode == MODE_CLAUDE && !claudeStatus.eligible)
      || (displayMode == MODE_CODEX && !codexStatus.eligible)
      || (displayMode == MODE_CURSOR && !cursorStatus.eligible)) displayMode = MODE_AUTO;
  return true;
}

