FelixLyfe/esp8266-ai/firmware/src/main.cpp
DisplayMode effectiveMode() {
  return displayMode;
}

void pollBridge() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) {
    Serial.printf("[bridge] skip poll: wifi=%d host='%s'\n", WiFi.status() == WL_CONNECTED, bridgeHost.c_str());
    return;
  }

  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + BRIDGE_DEFAULT_PATH;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);

  if (!http.begin(client, url)) {
    Serial.println("[bridge] http.begin() failed");
    return;
  }
  int code = http.GET();
  Serial.printf("[bridge] GET %s -> %d\n", url.c_str(), code);
  if (code == HTTP_CODE_OK) {
    String payload = http.getString();
    if (parseStatusJson(payload)) {
      lastSuccessMs = millis();
      everPolled = true;
      Serial.printf("[bridge] claude=%s tok=%ld | codex=%s tok=%ld primary=%.0f%%\n",
                    claudeStatus.status.c_str(), claudeStatus.tokensToday,
                    codexStatus.status.c_str(), codexStatus.tokensToday, codexStatus.primaryPct);
    } else {
      Serial.println("[bridge] JSON parse failed");
    }
  } else {
    claudeStatus.status = "offline";
    codexStatus.status = "offline";
  }
  http.end();
  DisplayMode eff = effectiveMode();
  if (eff != MODE_NET && eff != MODE_CPU) {
    // Only a real app switch clears the screen; a plain data refresh paints
    // in place so the poll doesn't flash the whole display.
    if (updateActiveApp()) drawActiveApp();
    else refreshActiveApp();
  }
}

// ---------- USB serial protocol ----------
// Frame: A5 5A | version | type | seq LE | length LE | payload | CRC32 LE.
// CRC covers version through payload. Structured payloads are JSON; files and
// RGB565 resources are transferred as acknowledged binary chunks.
enum USBMessage : uint8_t {
  USB_HELLO = 0x01, USB_HELLO_ACK = 0x02, USB_HEARTBEAT = 0x03, USB_HEARTBEAT_ACK = 0x04,
  USB_STATUS = 0x10, USB_NET = 0x11, USB_CPU = 0x12,
  USB_GET_INFO = 0x20, USB_DEVICE_INFO = 0x21, USB_COMMAND = 0x22, USB_GET_RESOURCE = 0x23,
  USB_RESOURCE_BEGIN = 0x30, USB_RESOURCE_CHUNK = 0x31, USB_RESOURCE_END = 0x32, USB_ACK = 0x7E
};
enum USBResource : uint8_t {
  USB_CLAUDE_GIF = 3, USB_CODEX_GIF = 4,
  USB_CLAUDE_SPRITE = 5, USB_CODEX_SPRITE = 6
};
const uint8_t USB_MAGIC_0 = 0xA5, USB_MAGIC_1 = 0x5A, USB_PROTOCOL_VERSION = 1;
const size_t USB_MAX_PAYLOAD = 1024;
const unsigned long USB_LINK_TIMEOUT_MS = 5000;
unsigned long lastUSBFrameMs = 0;
bool usbEverLinked = false;
uint8_t usbPayload[USB_MAX_PAYLOAD];
uint8_t usbHeader[8];
size_t usbHeaderLen = 0, usbPayloadLen = 0, usbExpectedLen = 0, usbCrcLen = 0;
uint8_t usbCrcBytes[4];

File usbTransferFile;
uint8_t usbTransferResource = 0;
uint8_t usbLastCompletedResource = 0;
uint32_t usbTransferExpected = 0, usbTransferReceived = 0;

bool wiredActive() { return usbEverLinked && (millis() - lastUSBFrameMs) < USB_LINK_TIMEOUT_MS; }

uint32_t usbCRC32Update(uint32_t crc, uint8_t byte) {
  crc ^= byte;
  for (int bit = 0; bit < 8; bit++) crc = (crc >> 1) ^ ((crc & 1) ? 0xEDB88320UL : 0);
  return crc;
}

uint32_t usbCRC32(const uint8_t *header, const uint8_t *payload, size_t len) {
  uint32_t crc = 0xFFFFFFFFUL;
  for (int i = 2; i < 8; i++) crc = usbCRC32Update(crc, header[i]);
  for (size_t i = 0; i < len; i++) crc = usbCRC32Update(crc, payload[i]);
  return crc ^ 0xFFFFFFFFUL;
}

void usbSendFrame(uint8_t type, uint16_t seq, const uint8_t *payload, uint16_t len) {
  uint8_t header[8] = {USB_MAGIC_0, USB_MAGIC_1, USB_PROTOCOL_VERSION, type,
                       (uint8_t)(seq & 0xFF), (uint8_t)(seq >> 8),
                       (uint8_t)(len & 0xFF), (uint8_t)(len >> 8)};
  uint32_t crc = usbCRC32(header, payload, len);
  Serial.write(header, sizeof(header));
  if (len) Serial.write(payload, len);
  uint8_t tail[4] = {(uint8_t)crc, (uint8_t)(crc >> 8), (uint8_t)(crc >> 16), (uint8_t)(crc >> 24)};
  Serial.write(tail, sizeof(tail));
}

void usbSendString(uint8_t type, uint16_t seq, const String &value) {
  usbSendFrame(type, seq, (const uint8_t *)value.c_str(), min(value.length(), USB_MAX_PAYLOAD));
}

void usbSendAck(uint16_t seq, uint8_t status = 0) {
  uint8_t payload[3] = {(uint8_t)(seq & 0xFF), (uint8_t)(seq >> 8), status};
  usbSendFrame(USB_ACK, 0, payload, sizeof(payload));
}

String usbPayloadString(const uint8_t *payload, size_t len) {
  String value;
  value.reserve(len);
  for (size_t i = 0; i < len; i++) value += (char)payload[i];
  return value;
}

// First data over either transport replaces the boot/portal screen.
void showMainUiIfNeeded() {
  if (mainUiShown) return;
  mainUiShown = true;
  drawStaticChrome();
  updateActiveApp();
  drawActiveApp();
}

void resetSpriteFromUSB(ActiveApp slot) {
  const char *path = slot == APP_CLAUDE ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
  LittleFS.remove(path);
  spriteRev++;
  loadCustomSpriteState();
  if (slot == APP_CLAUDE) claudeFrame = 0; else codexFrame = 0;
  if (currentApp == slot) drawActiveApp();
}

bool handleUSBCommand(const uint8_t *payload, size_t len) {
  JsonDocument doc;
  if (deserializeJson(doc, payload, len)) return false;
  if (doc["brightness"].is<int>()) {
    brightness = constrain(doc["brightness"].as<int>(), 0, 100);
    applyBrightness();
    saveBrightness();
  }
  const char *mode = doc["display"] | (const char *)nullptr;
  if (mode) {
    String m(mode);
    if (m == "auto") displayMode = MODE_AUTO;
    else if (m == "claude") displayMode = MODE_CLAUDE;
    else if (m == "codex") displayMode = MODE_CODEX;
    else if (m == "cursor") displayMode = MODE_CURSOR;
    else if (m == "net") displayMode = MODE_NET;
    else if (m == "cpu") displayMode = MODE_CPU;
    else return false;
  }
  const char *bridge = doc["bridge"] | (const char *)nullptr;
  if (bridge) { bridgeHost = bridge; bridgeHost.trim(); saveBridgeHost(bridgeHost); }
  const char *reset = doc["reset_sprite"] | (const char *)nullptr;
  if (reset) {
    if (!strcmp(reset, "claude")) resetSpriteFromUSB(APP_CLAUDE);
    else if (!strcmp(reset, "codex")) resetSpriteFromUSB(APP_CODEX);
    else return false;
  }
  return true;
}

const char *usbTransferTarget(uint8_t resource) {
  if (resource == USB_CLAUDE_GIF) return CLAUDE_GIF_FILE;
  if (resource == USB_CODEX_GIF) return CODEX_GIF_FILE;
  return nullptr;
}

bool beginUSBTransfer(const uint8_t *payload, size_t len) {
  if (len < 5 || !usbTransferTarget(payload[0])) return false;
  if (usbTransferFile) usbTransferFile.close();
  LittleFS.remove(USB_TRANSFER_FILE);
  usbTransferResource = payload[0];
  usbLastCompletedResource = 0;
  usbTransferExpected = (uint32_t)payload[1] | ((uint32_t)payload[2] << 8)
      | ((uint32_t)payload[3] << 16) | ((uint32_t)payload[4] << 24);
  usbTransferReceived = 0;
  usbTransferFile = LittleFS.open(USB_TRANSFER_FILE, "w");
  return (bool)usbTransferFile;
}

