FelixLyfe/esp8266-ai/firmware/src/main.cpp
bool appendUSBTransfer(const uint8_t *payload, size_t len) {
  if (len < 5 || !usbTransferFile || payload[0] != usbTransferResource) return false;
  uint32_t offset = (uint32_t)payload[1] | ((uint32_t)payload[2] << 8)
      | ((uint32_t)payload[3] << 16) | ((uint32_t)payload[4] << 24);
  // An ACK can be lost even though the block was committed. Accept an exact
  // duplicate range so the Mac can retry that block without restarting.
  if (offset < usbTransferReceived && offset + len - 5 <= usbTransferReceived) return true;
  if (offset != usbTransferReceived || usbTransferReceived + len - 5 > usbTransferExpected) return false;
  size_t written = usbTransferFile.write(payload + 5, len - 5);
  usbTransferReceived += written;
  return written == len - 5;
}

bool finishUSBTransfer(uint8_t resource) {
  if (!usbTransferFile && resource == usbLastCompletedResource) return true;
  if (!usbTransferFile || resource != usbTransferResource) return false;
  usbTransferFile.close();
  if (usbTransferReceived != usbTransferExpected) { LittleFS.remove(USB_TRANSFER_FILE); return false; }
  const char *target = usbTransferTarget(resource);
  LittleFS.remove(target);
  if (!LittleFS.rename(USB_TRANSFER_FILE, target)) return false;
  bool ok = true;
  if (resource == USB_CLAUDE_GIF || resource == USB_CODEX_GIF) {
    ActiveApp slot = resource == USB_CLAUDE_GIF ? APP_CLAUDE : APP_CODEX;
    const char *binPath = slot == APP_CLAUDE ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
    int w = slot == APP_CLAUDE ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
    int h = slot == APP_CLAUDE ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
    ok = decodeGifToBin(target, binPath, w, h);
    LittleFS.remove(target);
    if (ok) {
      spriteRev++;
      loadCustomSpriteState();
      if (slot == APP_CLAUDE) claudeFrame = 0; else codexFrame = 0;
      if (currentApp == slot) drawActiveApp();
    }
  }
  usbTransferResource = 0;
  usbLastCompletedResource = resource;
  usbTransferExpected = usbTransferReceived = 0;
  return ok;
}

void sendSpriteResource(uint16_t seq, USBResource resource) {
  ActiveApp slot = resource == USB_CODEX_SPRITE ? APP_CODEX : APP_CLAUDE;
  bool custom = slot == APP_CLAUDE ? claudeCustom : codexCustom;
  const char *path = slot == APP_CLAUDE ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
  int frames = slot == APP_CLAUDE ? claudeFrameCount() : codexFrameCount();
  int w = slot == APP_CLAUDE ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
  int h = slot == APP_CLAUDE ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
  size_t frameBytes = (size_t)w * h * 2;
  uint32_t total = 1 + (uint32_t)frames * frameBytes;
  uint8_t begin[5] = {(uint8_t)resource, (uint8_t)total, (uint8_t)(total >> 8),
                      (uint8_t)(total >> 16), (uint8_t)(total >> 24)};
  usbSendFrame(USB_RESOURCE_BEGIN, seq, begin, sizeof(begin));
  File file;
  if (custom) file = LittleFS.open(path, "r");
  const uint16_t *const *progmemFrames = slot == APP_CLAUDE ? claude_sprite_frames : codex_sprite_frames;
  uint8_t chunk[USB_MAX_PAYLOAD];
  uint32_t offset = 0;
  while (offset < total) {
    size_t count = min((uint32_t)(USB_MAX_PAYLOAD - 5), total - offset);
    chunk[0] = (uint8_t)resource;
    chunk[1] = (uint8_t)offset; chunk[2] = (uint8_t)(offset >> 8);
    chunk[3] = (uint8_t)(offset >> 16); chunk[4] = (uint8_t)(offset >> 24);
    if (custom) {
      file.seek(offset);
      file.read(chunk + 5, count);
    } else {
      for (size_t i = 0; i < count; i++) {
        uint32_t pos = offset + i;
        if (pos == 0) chunk[5 + i] = (uint8_t)frames;
        else {
          pos--;
          int frame = pos / frameBytes;
          size_t inFrame = pos % frameBytes;
          chunk[5 + i] = pgm_read_byte(((const uint8_t *)progmemFrames[frame]) + inFrame);
        }
      }
    }
    usbSendFrame(USB_RESOURCE_CHUNK, seq, chunk, count + 5);
    offset += count;
    yield();
  }
  if (file) file.close();
  uint8_t end = (uint8_t)resource;
  usbSendFrame(USB_RESOURCE_END, seq, &end, 1);
}

void handleUSBFrame(uint8_t type, uint16_t seq, const uint8_t *payload, size_t len) {
  lastUSBFrameMs = millis();
  usbEverLinked = true;
  if (type == USB_HELLO) { usbSendString(USB_HELLO_ACK, seq, buildDeviceInfoJson()); return; }
  if (type == USB_HEARTBEAT) { usbSendFrame(USB_HEARTBEAT_ACK, seq, nullptr, 0); return; }
  if (type == USB_STATUS) {
    if (parseStatusJson(usbPayloadString(payload, len))) {
      lastSuccessMs = millis(); everPolled = true; showMainUiIfNeeded();
      DisplayMode eff = effectiveMode();
      if (eff != MODE_NET && eff != MODE_CPU) {
        if (updateActiveApp()) drawActiveApp(); else refreshActiveApp();
      }
    }
    return;
  }
  if (type == USB_NET) { handleNetPayload(usbPayloadString(payload, len)); return; }
  if (type == USB_CPU) { handleCPUPayload(usbPayloadString(payload, len)); return; }
  if (type == USB_GET_INFO) { usbSendString(USB_DEVICE_INFO, seq, buildDeviceInfoJson()); return; }
  if (type == USB_COMMAND) { usbSendAck(seq, handleUSBCommand(payload, len) ? 0 : 1); return; }
  if (type == USB_RESOURCE_BEGIN) { usbSendAck(seq, beginUSBTransfer(payload, len) ? 0 : 1); return; }
  if (type == USB_RESOURCE_CHUNK) { usbSendAck(seq, appendUSBTransfer(payload, len) ? 0 : 1); return; }
  if (type == USB_RESOURCE_END) {
    bool ok = len == 1 && finishUSBTransfer(payload[0]);
    usbSendAck(seq, ok ? 0 : 1);
    return;
  }
  if (type == USB_GET_RESOURCE && len == 1) {
    USBResource resource = (USBResource)payload[0];
    if (resource == USB_CLAUDE_SPRITE || resource == USB_CODEX_SPRITE) sendSpriteResource(seq, resource);
  }
}

void resetUSBParser() {
  usbHeaderLen = usbPayloadLen = usbExpectedLen = usbCrcLen = 0;
}

// Streaming parser resynchronizes on A5 5A, so ROM boot bytes and debug logs
// cannot become commands. A CRC failure drops only that frame.
void pumpSerial() {
  while (Serial.available()) {
    uint8_t byte = Serial.read();
    if (usbHeaderLen < 2) {
      if (usbHeaderLen == 0 && byte == USB_MAGIC_0) usbHeader[usbHeaderLen++] = byte;
      else if (usbHeaderLen == 1 && byte == USB_MAGIC_1) usbHeader[usbHeaderLen++] = byte;
      else usbHeaderLen = byte == USB_MAGIC_0 ? 1 : 0;
      continue;
    }
    if (usbHeaderLen < 8) {
      usbHeader[usbHeaderLen++] = byte;
      if (usbHeaderLen == 8) {
        usbExpectedLen = (size_t)usbHeader[6] | ((size_t)usbHeader[7] << 8);
        if (usbHeader[2] != USB_PROTOCOL_VERSION || usbExpectedLen > USB_MAX_PAYLOAD) resetUSBParser();
      }
      continue;
    }
    if (usbPayloadLen < usbExpectedLen) { usbPayload[usbPayloadLen++] = byte; continue; }
    usbCrcBytes[usbCrcLen++] = byte;
    if (usbCrcLen == 4) {
      uint32_t expected = (uint32_t)usbCrcBytes[0] | ((uint32_t)usbCrcBytes[1] << 8)
          | ((uint32_t)usbCrcBytes[2] << 16) | ((uint32_t)usbCrcBytes[3] << 24);
      uint32_t actual = usbCRC32(usbHeader, usbPayload, usbExpectedLen);
      if (expected == actual) {
        uint16_t seq = (uint16_t)usbHeader[4] | ((uint16_t)usbHeader[5] << 8);
        handleUSBFrame(usbHeader[3], seq, usbPayload, usbExpectedLen);
      }
      resetUSBParser();
    }
  }
}

// ---------- web admin ----------

String htmlEscape(const String &s) {
  String out = s;
  out.replace("&", "&amp;");
  out.replace("<", "&lt;");
  out.replace(">", "&gt;");
  out.replace("\"", "&quot;");
  return out;
}

void handleRoot() {
  String age = everPolled ? String((millis() - lastSuccessMs) / 1000) + "s ago" : "never";
  String html;
  html.reserve(3072);
  html += "<!DOCTYPE html><html><head><meta charset='utf-8'>";
  html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
  html += "<title>AI Clock 设置</title>";
  html += "<style>body{font-family:-apple-system,sans-serif;max-width:480px;margin:24px "
          "auto;padding:0 16px;color:#222} h1{font-size:20px} label{display:block;margin-top:16px;font-weight:600}"
          "input{width:100%;box-sizing:border-box;padding:8px;font-size:16px;margin-top:4px}"
          "button{margin-top:16px;padding:10px 20px;font-size:16px;background:#2563eb;color:#fff;"
          "border:none;border-radius:6px}"
          "table{margin-top:20px;border-collapse:collapse;width:100%}"
          "td{padding:4px 8px;border-bottom:1px solid #eee;font-size:14px}"
          ".dot{display:inline-block;width:10px;height:10px;border-radius:50%;margin-right:6px}"
          "</style></head><body>";
  html += "<h1>AI Clock 设置</h1>";

  html += "<form method='POST' action='/save'>";
  html += "<label>Bridge host (ip:port)</label>";
  html += "<input name='bridge' value='" + htmlEscape(bridgeHost) + "' placeholder='192.168.1.181:8765'>";
  html += "<button type='submit'>保存</button>";
  html += "</form>";

  // Backlight brightness slider: applies live on release (PWM, persisted).
  html += "<h2 style='font-size:16px;margin-top:28px'>屏幕亮度</h2>";
  html += "<input type='range' min='0' max='100' value='" + String(brightness) + "' id='bri' "
          "oninput=\"document.getElementById('briv').textContent=this.value+'%'\" "
          "onchange=\"fetch('/api/brightness',{method:'POST',headers:{'Content-Type':"
          "'application/x-www-form-urlencoded'},body:'level='+this.value})\">";
  html += "<div style='font-size:13px;color:#555'>当前：<span id='briv'>" + String(brightness) +
          "%</span>（0 = 熄屏，设置立即生效并记住）</div>";

  // On-device GIF upload: replaces a character's animation without reflashing.
  html += "<h2 style='font-size:16px;margin-top:28px'>桌宠动画（上传 GIF）</h2>";
  html += "<p style='font-size:13px;color:#555'>上传一个 .gif，设备会在板上解码并缩放到对应角色的尺寸，"
          "立刻替换动画，无需重新编译或烧录。GIF 太大可能因内存不足解码失败，换小一点的即可。</p>";
  html += "<form id='gifForm' method='POST' enctype='multipart/form-data' onsubmit='return setGifAction()'>";
  html += "<label>角色</label>";
  html += "<select id='gifTarget'><option value='claude'>Claude</option><option value='codex'>Codex</option></select>";
  html += "<label>GIF 文件</label><input type='file' name='file' accept='.gif' required>";
  html += "<button type='submit'>上传并应用</button>";
  html += "</form>";
  html += "<script>function setGifAction(){"
          "document.getElementById('gifForm').action='/sprite/'+document.getElementById('gifTarget').value;"
          "return true;}</script>";

  html += "<table>";
  html += "<tr><td>WiFi SSID</td><td>" + htmlEscape(WiFi.SSID()) + "</td></tr>";
  html += "<tr><td>设备 IP</td><td>" + WiFi.localIP().toString() + "</td></tr>";
  html += "<tr><td>上次桥接更新</td><td>" + age + "</td></tr>";
  html += "<tr><td>Claude</td><td>" + htmlEscape(claudeStatus.status) + ", " +
          formatTokens(claudeStatus.tokensToday) + " tok</td></tr>";
  html += "<tr><td>Codex</td><td>" + htmlEscape(codexStatus.status) + ", " +
          formatTokens(codexStatus.tokensToday) + " tok, 5h left " + pctText(remainingPct(codexStatus.primaryPct)) +
          ", Wk left " + pctText(remainingPct(codexStatus.weeklyPct)) + "</td></tr>";
  html += "<tr><td>Cursor</td><td>Total left " +
          pctText(remainingPct(cursorStatus.totalPct)) + ", Auto left " +
          pctText(remainingPct(cursorStatus.autoPct)) + ", API left " +
          pctText(remainingPct(cursorStatus.apiPct)) + "</td></tr>";
  html += "</table>";

